Masmiseim36/nxpSDK/boards/evkmimxrt595_agm01/issdk_examples/sensors/fxas21002/fxas21002_poll/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
                                                                    /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC6 0x06u            /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C11_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C11_DeinitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC5_SCK (coord K2), JP26[4]
  @{ */
                                                   /* @} */

/*! @name FC5_CTS_SDA_SSEL0 (coord N4), JP26[1]
  @{ */
                                                         /* @} */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord L2), JP26[2]
  @{ */
                                                              /* @} */

/*! @name FC5_TXD_SCL_MISO_WS (coord K1), JP26[3]
  @{ */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI5_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_4 (coord K1), JP26[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SPI5_DEINITPINS_SPI_MISO_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define SPI5_DEINITPINS_SPI_MISO_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define SPI5_DEINITPINS_SPI_MISO_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define SPI5_DEINITPINS_SPI_MISO_PIN 4U                   /*!<@brief PORT pin number */
#define SPI5_DEINITPINS_SPI_MISO_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_5 (coord L2), JP26[2]
  @{ */

/* Symbols to be used with GPIO driver */
#define SPI5_DEINITPINS_SPI_MOSI_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define SPI5_DEINITPINS_SPI_MOSI_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define SPI5_DEINITPINS_SPI_MOSI_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define SPI5_DEINITPINS_SPI_MOSI_PIN 5U                   /*!<@brief PORT pin number */
#define SPI5_DEINITPINS_SPI_MOSI_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_6 (coord N4), JP26[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define SPI5_DEINITPINS_SPI_SS0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define SPI5_DEINITPINS_SPI_SS0_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define SPI5_DEINITPINS_SPI_SS0_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define SPI5_DEINITPINS_SPI_SS0_PIN 6U                   /*!<@brief PORT pin number */
#define SPI5_DEINITPINS_SPI_SS0_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_3 (coord K2), JP26[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define SPI5_DEINITPINS_SPI_CLK_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define SPI5_DEINITPINS_SPI_CLK_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define SPI5_DEINITPINS_SPI_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define SPI5_DEINITPINS_SPI_CLK_PIN 3U                   /*!<@brief PORT pin number */
#define SPI5_DEINITPINS_SPI_CLK_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI5_DeinitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
                                                                     /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void USART0_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_2 (coord H16), J45[22]/U9[13]/U105[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define USART0_DEINITPINS_DEBUG_UART_RX_GPIO GPIO                      /*!<@brief GPIO peripheral base pointer */
#define USART0_DEINITPINS_DEBUG_UART_RX_GPIO_PIN_MASK (1U << 2U)       /*!<@brief GPIO pin mask */
#define USART0_DEINITPINS_DEBUG_UART_RX_PORT 0U                        /*!<@brief PORT peripheral base pointer */
#define USART0_DEINITPINS_DEBUG_UART_RX_PIN 2U                         /*!<@brief PORT pin number */
#define USART0_DEINITPINS_DEBUG_UART_RX_PIN_MASK (1U << 2U)            /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO0_1 (coord G16), J45[32]/U105[3]/U9[12]
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define USART0_DEINITPINS_DEBUG_UART_TXD_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define USART0_DEINITPINS_DEBUG_UART_TXD_GPIO_PIN_MASK (1U << 1U)
/*!
 * @brief PORT peripheral base pointer */
#define USART0_DEINITPINS_DEBUG_UART_TXD_PORT 0U
/*!
 * @brief PORT pin number */
#define USART0_DEINITPINS_DEBUG_UART_TXD_PIN 1U
/*!
 * @brief PORT pin mask */
#define USART0_DEINITPINS_DEBUG_UART_TXD_PIN_MASK (1U << 1U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void USART0_DeinitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
